package Java.Seminars.Seminar01;


import java.time.LocalDateTime;

public class Task01 {
    public static void main(String[] args) {
        /*
         * Задача 1
         * Настроить проект, вывести в консоль “Hello world!”.
         * Вывести в консоль системные дату и время.
         */

        
        System.out.println("Hello world!");

        System.out.println(LocalDateTime.now());
    }
}
